<h1>Добро пожаловать!</h1>
<p>
<img src="/images/faf7-442.jpg" width="18%" align="left" >
Сайт содержит регистрацию, вход для зарегистрированных пользователей, вывод всех постов, если пользователь не вошел под своим логином и вывод постов определенного пользователя.
Страница 'Login' содержит информацию о пользователи, позволяет загрузить картинку, изменить данные и выйти из профиля. Страница 'List of posts' позволяет добавить новый пост, также на странице отображаются ранее добавленные записи.
Данные хранятся в базе данных 'My site'. БД содержит две таблицы пользователи и посты, связанные по нику пользователя. Используется active record, данные в бд вводятся на латинице. При входе пользователя сохраняется логин, по которому отображается информация о пользователи и его посты. После выхода логин обнуляется.
</p>
